particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
void BleEventDispatcher::bleEventDispatchThread(void *context) {
    BleEventDispatcher* dispatcher = (BleEventDispatcher*)context;
    while (true) {
        uint8_t event;
        if (os_msg_recv(dispatcher->allEvtQueue_, &event, 0xFFFFFFFF) == true) {
            if (event == EVENT_IO_TO_APP) {
                T_IO_MSG message;
                if (os_msg_recv(dispatcher->ioEvtQueue_, &message, 0) == true) {
                    // Handled by application directly
                    dispatcher->handleIoMessage(message);
                }
            } else {
                // Handled by BT lib, which will finally invoke the registered callback.
                // Do not do time consuming stuff in the callbacks.
                gap_handle_msg(event);
            }
        }
    }
}

int BleGap::init() {
    T_GAP_DEV_STATE state;
    CHECK_RTL(le_get_gap_param(GAP_PARAM_DEV_STATE , &state));
    if (state.gap_init_state == GAP_INIT_STATE_STACK_READY) {
        return SYSTEM_ERROR_NONE;
    }
    gap_config_max_le_link_num(MAX_LINK_COUNT);
    gap_config_max_le_paired_device(MAX_LINK_COUNT);
    CHECK_TRUE(bte_init(), SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(le_gap_init(MAX_LINK_COUNT), SYSTEM_ERROR_INTERNAL);
    uint8_t mtuReq = false;
    CHECK_RTL(le_set_gap_param(GAP_PARAM_SLAVE_INIT_GATT_MTU_REQ, sizeof(mtuReq), &mtuReq));

    CHECK(setAppearance(GAP_GATT_APPEARANCE_UNKNOWN));

    char devName[BLE_MAX_DEV_NAME_LEN] = {};
    CHECK(get_device_name(devName, sizeof(devName)));
    CHECK(setDeviceName(devName, strlen(devName)));

    CHECK(setAdvertisingParameters(&advParams_));

    /* register gap message callback */
    le_register_app_cb(gapEventCallback);
    return SYSTEM_ERROR_NONE;
}

int BleGap::start() const {
    if (state_.gap_init_state == 0) {
        CHECK(BleEventDispatcher::getInstance().start());
        LOG_DEBUG(TRACE, "Waiting ready...");
        T_GAP_DEV_STATE state;
        do {
            HAL_Delay_Milliseconds(100);
            le_get_gap_param(GAP_PARAM_DEV_STATE , &state);
        } while (state.gap_init_state != GAP_INIT_STATE_STACK_READY);
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::setAppearance(uint16_t appearance) const {
    CHECK_RTL(le_set_gap_param(GAP_PARAM_APPEARANCE, sizeof(appearance), &appearance));
    return SYSTEM_ERROR_NONE;
}

int BleGap::setDeviceName(const char* deviceName, size_t len) const {
    char name[BLE_MAX_DEV_NAME_LEN] = {};
    if (deviceName == nullptr || len == 0) {
        CHECK(get_device_name(name, sizeof(name)));
        len = strlen(name);
    } else {
        len = std::min(len, sizeof(name));
        memcpy(name, deviceName, len);
    }
    CHECK_RTL(le_set_gap_param(GAP_PARAM_DEVICE_NAME, std::min(BLE_MAX_DEV_NAME_LEN, (int)len), (void*)name));
    return SYSTEM_ERROR_NONE;
}

int BleGap::setAdvertisingParameters(const hal_ble_adv_params_t* params) {
    CHECK_TRUE(params, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(&advParams_, params, std::min(advParams_.size, params->size));
    uint8_t  advEvtType = toPlatformAdvEvtType(params->type);
    uint8_t  advDirectType = GAP_REMOTE_ADDR_LE_PUBLIC;
    uint8_t  advDirectAddr[GAP_BD_ADDR_LEN] = { 0 };
    uint8_t  advChannMap = GAP_ADVCHAN_ALL;
    uint8_t  advFilterPolicy = params->filter_policy;
    uint16_t advInterval = params->interval;
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_EVENT_TYPE, sizeof(advEvtType), &advEvtType));
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_DIRECT_ADDR_TYPE, sizeof(advDirectType), &advDirectType));
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_DIRECT_ADDR, sizeof(advDirectAddr), advDirectAddr));
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_CHANNEL_MAP, sizeof(advChannMap), &advChannMap));
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_FILTER_POLICY, sizeof(advFilterPolicy), &advFilterPolicy));
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_INTERVAL_MIN, sizeof(advInterval), &advInterval));
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_INTERVAL_MAX, sizeof(advInterval), &advInterval));
    return SYSTEM_ERROR_NONE;
}

int BleGap::getAdvertisingParameters(hal_ble_adv_params_t* params) const {
    CHECK_TRUE(params, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(params, &advParams_, std::min(advParams_.size, params->size));
    return SYSTEM_ERROR_NONE;
}

int BleGap::setAdvertisingData(const uint8_t* buf, size_t len) {
    if (buf != nullptr) {
        len = std::min(len, (size_t)BLE_MAX_ADV_DATA_LEN);
        memcpy(advData_, buf, len);
    } else {
        len = 0;
    }
    advDataLen_ = len;
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_DATA, len, (void*)buf));
    return SYSTEM_ERROR_NONE;
}

ssize_t BleGap::getAdvertisingData(uint8_t* buf, size_t len) const {
    if (!buf) {
        return advDataLen_;
    }
    len = std::min(len, advDataLen_);
    memcpy(buf, advData_, len);
    return len;
}

int BleGap::setScanResponseData(const uint8_t* buf, size_t len) {
    if (buf != nullptr) {
        len = std::min(len, (size_t)BLE_MAX_ADV_DATA_LEN);
        memcpy(scanRespData_, buf, len);
    } else {
        len = 0;
    }
    scanRespDataLen_ = len;
    CHECK_RTL(le_adv_set_param(GAP_PARAM_SCAN_RSP_DATA, len, (void*)buf));
    return SYSTEM_ERROR_NONE;
}

ssize_t BleGap::getScanResponseData(uint8_t* buf, size_t len) const {
    if (!buf) {
        return scanRespDataLen_;
    }
    len = std::min(len, scanRespDataLen_);
    memcpy(buf, scanRespData_, len);
    return len;
}

int BleGap::startAdvertising() const {
    // The attribute table needs to be registered before BT stack starts.
    // Now we assume that the attribute table is finalized.
    // Register it to BT stack
    BleGatt::getInstance().registerAttributeTable();
    // Starts the BT stack
    CHECK(BleGap::getInstance().start());

    if (state_.gap_adv_state != GAP_ADV_STATE_ADVERTISING && state_.gap_adv_state != GAP_ADV_STATE_START) {
        CHECK(le_adv_start());
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::stopAdvertising() const {
    if (state_.gap_adv_state == GAP_ADV_STATE_ADVERTISING || state_.gap_adv_state == GAP_ADV_STATE_START) {
        CHECK(le_adv_stop());
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::disconnect() const {
    if (connHandle_ != BLE_INVALID_CONN_HANDLE) {
        CHECK(le_disconnect(connHandle_));
    }
    return SYSTEM_ERROR_NONE;
}

void BleGap::handleDevStateChanged(T_GAP_DEV_STATE newState, uint16_t cause) {
    LOG_DEBUG(TRACE, "GAP state updated, init:%d, adv:%d, adv-sub:%d, scan:%d, conn:%d, cause:%d",
                        newState.gap_init_state, newState.gap_adv_state, newState.gap_adv_sub_state, newState.gap_scan_state, newState.gap_conn_state, cause);
    if (state_.gap_init_state == 0 && newState.gap_init_state == 1) {
        LOG_DEBUG(TRACE, "Start BT co-existence.");
        bt_coex_init();
        wifi_btcoex_set_bt_on();
    }
    state_ = newState;
}

void BleGap::handleConnectionStateChanged(uint8_t connHandle, T_GAP_CONN_STATE newState, uint16_t discCause) {
    if (newState == GAP_CONN_STATE_CONNECTING) {
        connecting_ = true;
    } else {
        connecting_ = false;
    }
    switch (newState) {
        case GAP_CONN_STATE_CONNECTING: {
            LOG_DEBUG(TRACE, "Connecting...");
            break;
        }
        case GAP_CONN_STATE_DISCONNECTING: {
            LOG_DEBUG(TRACE, "Disconnecting...");
            break;
        }
        case GAP_CONN_STATE_DISCONNECTED: {
            connHandle_ = BLE_INVALID_CONN_HANDLE;
            if ((discCause != (HCI_ERR | HCI_ERR_REMOTE_USER_TERMINATE)) && (discCause != (HCI_ERR | HCI_ERR_LOCAL_HOST_TERMINATE))) {
                // placeholder
            }
            LOG_DEBUG(TRACE, "[BLE peripheral] Disconnected, handle:%d, cause:0x%x, re-start ADV", connHandle, discCause);
            if (periphLinkCallback_) {
                hal_ble_link_evt_t evt = {};
                evt.type = BLE_EVT_DISCONNECTED;
                evt.conn_handle = connHandle;
                evt.params.disconnected.reason = (uint8_t)discCause;
                periphLinkCallback_(&evt, periphLinkCallbackContext_);
            }
            BleGatt::getInstance().removeSubscriber(connHandle);
            startAdvertising();
            break;
        }
        case GAP_CONN_STATE_CONNECTED: {
            connHandle_ = connHandle;
            hal_ble_addr_t peerAddr = {};
            peerAddr.addr_type = BLE_SIG_ADDR_TYPE_PUBLIC;
            le_get_conn_addr(connHandle, peerAddr.addr, (uint8_t *)&peerAddr.addr_type);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams_.min_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams_.max_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &connParams_.slave_latency, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &connParams_.conn_sup_timeout, connHandle);
            LOG_DEBUG(TRACE, "[BLE peripheral] Connected, interval:0x%x, latency:0x%x, timeout:0x%x",
                            connParams_.max_conn_interval, connParams_.slave_latency, connParams_.conn_sup_timeout);
            if (periphLinkCallback_) {
                hal_ble_link_evt_t evt = {};
                hal_ble_conn_info_t info = {};
                info.version = BLE_API_VERSION;
                info.size = sizeof(hal_ble_conn_info_t);
                info.role = BLE_ROLE_PERIPHERAL;
                info.conn_handle = connHandle;
                info.conn_params = connParams_;
                info.address = peerAddr;
                info.att_mtu = BLE_DEFAULT_ATT_MTU_SIZE; // Use the default ATT_MTU on connected.
                evt.type = BLE_EVT_CONNECTED;
                evt.conn_handle = info.conn_handle;
                evt.params.connected.info = &info;
                periphLinkCallback_(&evt, periphLinkCallbackContext_);
            }
            break;
        }
        default: break;
    }
}

void BleGap::handleMtuUpdated(uint8_t connHandle, uint16_t mtuSize) {
    LOG_DEBUG(TRACE, "handleMtuUpdated: handle:%d, mtu_size:%d", connHandle, mtuSize);
}

void BleGap::handleConnParamsUpdated(uint8_t connHandle, uint8_t status, uint16_t cause) {
    switch (status) {
        case GAP_CONN_PARAM_UPDATE_STATUS_SUCCESS: {
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams_.min_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams_.max_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &connParams_.slave_latency, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &connParams_.conn_sup_timeout, connHandle);
            LOG_DEBUG(TRACE, "handleConnParamsUpdated: update success: interval:0x%x, latency:0x%x, timeout:0x%x",
                            connParams_.max_conn_interval, connParams_.slave_latency, connParams_.conn_sup_timeout);
            break;
        }
        case GAP_CONN_PARAM_UPDATE_STATUS_FAIL: {
            LOG_DEBUG(TRACE, "handleConnParamsUpdated, update failed: cause 0x%x", cause);
            break;
        }
        case GAP_CONN_PARAM_UPDATE_STATUS_PENDING: {
            LOG_DEBUG(TRACE, "handleConnParamsUpdated, update pending: conn_id %d", connHandle);
            break;
        }
        default: break;
    }
}

